toc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-10-11 Fri 10:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Programming Languages @BUCS</title>
<meta name="author" content="Nathan  Mull" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="myStyle.css" />
</head>
<body>
<div id="org-div-home-and-up"><a href="https://nmmull.github.io">↩</a></div><div id="content" class="content">
<h1 class="title">Programming Languages @BUCS
<br />
<span class="subtitle">UNDER CONSTRUCTION</span>
</h1>
<p>
This is a set of notes for <i>CAS CS 320: Principles of Programming
Langauges</i> at Boston Univeristy.  They are based on material created
by several members of the Principles of Programming and Verification
(POPV) group.
</p>

<p>
These notes are <b>incredibly incredibly rough</b>. They are likely rife
with typos, misspellings and grammatical errors, poorly written
sections, missing explanations, etc. To students: we appreciate your
(assumed) patience. To everyone: any comments are welcome. If you spot
a error, you are encouraged to post an issue to the associated GitHub
repository.
</p>

<ul class="org-ul">
<li><a id="orga30ea98"></a>The Interpretation Pipeline<br /></li>
<li><a id="org6772549"></a><a href="Formal-Grammar/notes.html">Formal Grammar</a><br /></li>
<li><a id="org25c9fdf"></a>Parser Generators<br /></li>
<li><a id="orgaa19907"></a>Formal Semantics<br /></li>
<li><a id="org6ffeee5"></a>Type Checking<br /></li>
<li><a id="org052ffcd"></a>Type Inference<br /></li>
</ul>
</div>
</body>
</html>
